[
  {
    "key": "aquarius_rat__aquarius_rat",
    "score": 94,
    "label": "Shared Vision & Electric Energy",
    "blurb": "Ideas never sleep with these two. The Rat's clever mind sharpens Aquarius' vision, and together they dream in practical colors. They're quick to laugh and even quicker to plan the next adventure. If they learn to rest between creations, love has space to breathe."
  },
  {
    "key": "aquarius_ox__aquarius_ox",
    "score": 82,
    "label": "Discipline Meets Imagination",
    "blurb": "A strange but fascinating mix of freedom and structure. The Ox grounds Aquarius' wild ideas, while Aquarius gently teaches the Ox to bend instead of break. It takes patience and humor to meet in the middle, but when they do, this becomes a quiet, lasting strength."
  },
  {
    "key": "aquarius_tiger__aquarius_tiger",
    "score": 92,
    "label": "Freedom & Fearless Affection",
    "blurb": "They recognize each other's courage right away. Both crave excitement and truth, and neither fears the unknown. Passion and ideals run high here — if they learn to listen as much as they lead, this becomes a love built on mutual respect and motion."
  },
  {
    "key": "aquarius_rabbit__aquarius_rabbit",
    "score": 85,
    "label": "Gentle Curiosity & Growth",
    "blurb": "The Rabbit softens Aquarius' edges; Aquarius opens the Rabbit's mind. There's a rhythm of curiosity and kindness that makes this pairing quietly magnetic. Still, one dreams of peace while the other seeks change — they'll need to hold each other gently through life's turns."
  },
  {
    "key": "aquarius_dragon__aquarius_dragon",
    "score": 97,
    "label": "Power & Shared Destiny",
    "blurb": "A dazzling match of charisma and vision. Both want to leave their mark on the world, and they understand ambition without envy. The Dragon's fire fuels Aquarius' genius, while Aquarius' calm steadies the Dragon's pride. Together, they build and believe in something larger than themselves."
  },
  {
    "key": "aquarius_snake__aquarius_snake",
    "score": 76,
    "label": "Depth Meets Distance",
    "blurb": "These two share intellect but not always tempo. The Snake prefers silence and subtlety; Aquarius speaks in lightning bolts. They learn from each other — one patience, the other presence — yet this bond needs space and trust to thrive. Too much pressure and the magic slips away."
  },
  {
    "key": "aquarius_horse__aquarius_horse",
    "score": 95,
    "label": "Adventure & True Understanding",
    "blurb": "The air crackles when they meet. Both love freedom, laughter, and new experiences. The Horse's passion ignites Aquarius' imagination, and Aquarius makes the Horse feel truly seen. As long as neither tries to control the other, this love moves like music."
  },
  {
    "key": "aquarius_goat__aquarius_goat",
    "score": 80,
    "label": "Heart & Horizon",
    "blurb": "The Goat feels deeply; Aquarius thinks widely. This can be a lesson in balance — one teaches empathy, the other perspective. They may misunderstand each other at first, but when kindness outweighs fear, they find a love that heals more than it hurts."
  },
  {
    "key": "aquarius_monkey__aquarius_monkey",
    "score": 98,
    "label": "Playful Genius & Natural Flow",
    "blurb": "A meeting of wit, mischief, and brilliance. They challenge and charm each other in equal measure, always pushing the limits of fun and thought. The world around them can't keep up, but inside their laughter, there's loyalty too. This is one of the rare pairs that can have it all."
  },
  {
    "key": "aquarius_rooster__aquarius_rooster",
    "score": 79,
    "label": "Logic & Idealism",
    "blurb": "One dreams of possibilities, the other seeks proof. Aquarius may find the Rooster too serious; the Rooster may see Aquarius as too detached. Yet both admire conviction — if they can turn criticism into collaboration, they'll uncover unexpected respect."
  },
  {
    "key": "aquarius_dog__aquarius_dog",
    "score": 84,
    "label": "Trust & Shared Purpose",
    "blurb": "Loyalty meets idealism in a thoughtful union. The Dog's devotion reassures Aquarius' wandering heart, while Aquarius brings the Dog a sense of wonder. They share values and purpose, though they must remember to keep playfulness alive amid principle."
  },
  {
    "key": "aquarius_pig__aquarius_pig",
    "score": 88,
    "label": "Kindness & Vision",
    "blurb": "Kind souls with open hearts. The Pig's warmth and generosity give Aquarius a safe place to land, while Aquarius lifts the Pig toward new dreams. Sometimes the Pig feels unheard, sometimes Aquarius feels too free — but when love is patient, this pairing becomes grace itself."
  }
]

